cases/transport/0/subsurface/DSub_Coeff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "300/subsurface";
    object      DSub_CoeffMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
7200
(
(1.50899e-09 1.73876e-10 1.01506e-10 1.73876e-10 6.07576e-10 1.01506e-10 1.01506e-10 1.01506e-10 6.01506e-10)
(1.41493e-09 1.60061e-10 9.20883e-11 1.60061e-10 5.98037e-10 9.20883e-11 9.20883e-11 9.20883e-11 5.92088e-10)
(1.32767e-09 1.46174e-10 8.33358e-11 1.46174e-10 5.89026e-10 8.33358e-11 8.33358e-11 8.33358e-11 5.83336e-10)
(1.24842e-09 1.32347e-10 7.53713e-11 1.32347e-10 5.80662e-10 7.53713e-11 7.53713e-11 7.53713e-11 5.75371e-10)
(1.17819e-09 1.18661e-10 6.82922e-11 1.18661e-10 5.73023e-10 6.82922e-11 6.82922e-11 6.82922e-11 5.68292e-10)
(1.11799e-09 1.0532e-10 6.2192e-11 1.0532e-10 5.6612e-10 6.2192e-11 6.2192e-11 6.2192e-11 5.62192e-10)
(1.0684e-09 9.25872e-11 5.7139e-11 9.25872e-11 5.60128e-10 5.7139e-11 5.7139e-11 5.7139e-11 5.57139e-10)
(1.02983e-09 8.0545e-11 5.3187e-11 8.0545e-11 5.5523e-10 5.3187e-11 5.3187e-11 5.3187e-11 5.53187e-10)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<tensor> 
120
(
(1.51167e-09 1.01167e-10 1.01167e-10 1.01167e-10 6.01167e-10 1.01167e-10 1.01167e-10 1.01167e-10 6.01167e-10)
(1.41757e-09 9.17569e-11 9.17569e-11 9.17569e-11 5.91757e-10 9.17569e-11 9.17569e-11 9.17569e-11 5.91757e-10)
(1.33018e-09 8.30185e-11 8.30185e-11 8.30185e-11 5.83018e-10 8.30185e-11 8.30185e-11 8.30185e-11 5.83018e-10)
(1.25075e-09 7.50749e-11 7.50749e-11 7.50749e-11 5.75075e-10 7.50749e-11 7.50749e-11 7.50749e-11 5.75075e-10)
(1.18022e-09 6.80222e-11 6.80222e-11 6.80222e-11 5.68022e-10 6.80222e-11 6.80222e-11 6.80222e-11 5.68022e-10)
(1.11968e-09 6.19683e-11 6.19683e-11 6.19683e-11 5.61968e-10 6.19683e-11 6.19683e-11 6.19683e-11 5.61968e-10)
(1.06969e-09 5.69692e-11 5.69692e-11 5.69692e-11 5.56969e-10 5.69692e-11 5.69692e-11 5.69692e-11 5.56969e-10)
(1.0307e-09 5.30696e-11 5.30696e-11 5.30696e-11 5.5307e-10 5.30696e-11 5.30696e-11 5.30696e-11 5.5307e-10)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
