cases/transport/0/subsurface/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "300/subsurface";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7200
(
(1.0106e-06 8.04946e-08 7.72109e-26)
(9.16694e-07 7.56396e-08 -2.05673e-22)
(8.29513e-07 6.99486e-08 -2.10144e-22)
(7.50278e-07 6.34668e-08 -0)
(6.79889e-07 5.62509e-08 -3.34174e-25)
(6.19152e-07 4.83677e-08 -3.68097e-27)
(5.68768e-07 3.98934e-08 -0)
(5.29324e-07 3.09125e-08 -0)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(9.65467e-06 4.183e-05 -0)
(-3.07277e-07 4.53597e-05 3.92205e-22)
(-1.03088e-05 4.59409e-05 4.00505e-22)
(-2.0479e-05 4.65669e-05 -3.83507e-22)
(-3.03718e-05 4.26254e-05 -3.37862e-22)
(-3.8701e-05 3.69663e-05 2.89335e-22)
(-4.55864e-05 2.97339e-05 -0)
(-5.06744e-05 2.10772e-05 -0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(1.0106e-06 -0 7.72109e-26)
(9.16694e-07 -0 -2.05673e-22)
(8.29513e-07 -0 -2.10144e-22)
(7.50278e-07 -0 -0)
(6.79889e-07 -0 -3.34174e-25)
(6.19152e-07 -0 -3.68097e-27)
(5.68768e-07 -0 -0)
(5.29324e-07 -0 -0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
