cases/transport/0/subsurface/UPrime2Mean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "300/subsurface";
    object      UPrime2Mean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
7200
(
(1.51205e-12 3.12594e-14 0 6.57218e-16 0 0)
(1.43675e-12 3.10678e-14 0 6.8373e-16 0 0)
(1.36238e-12 3.04871e-14 0 6.95144e-16 0 0)
(1.29009e-12 2.95478e-14 6.19242e-34 6.90631e-16 1.4438e-35 3.29656e-55)
(1.22074e-12 2.82852e-14 -9.73254e-31 6.7018e-16 -2.34726e-32 8.53237e-49)
(1.15506e-12 2.67388e-14 0 6.34592e-16 0 0)
(1.0937e-12 2.49501e-14 -2.74319e-30 5.85447e-16 -6.53855e-32 7.60001e-48)
(1.03719e-12 2.29605e-14 1.77315e-30 5.25029e-16 4.11007e-32 3.35638e-48)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
120
(
(3.27703e-09 7.25459e-09 -8.48778e-27 1.61322e-08 -1.89957e-26 2.31655e-44)
(3.43422e-10 -1.36593e-09 -3.4765e-27 5.80858e-09 1.4429e-26 3.63452e-44)
(1.41052e-09 -1.4503e-09 -4.90037e-27 1.56757e-09 5.07573e-27 1.70843e-44)
(1.1994e-09 -3.43988e-10 -1.77315e-30 1.50321e-10 4.99621e-31 2.62901e-51)
(4.92618e-10 4.89942e-11 -5.84811e-28 5.31041e-11 -7.97196e-29 7.77287e-46)
(2.01996e-10 -2.55104e-11 -1.52721e-31 5.91366e-11 1.67101e-32 2.56896e-52)
(1.83471e-10 -6.64351e-11 -2.84691e-28 7.76274e-11 9.33711e-30 6.51818e-46)
(2.04209e-10 -4.85701e-11 0 5.08458e-11 0 0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
120
(
(1.51205e-12 0 0 0 0 0)
(1.43675e-12 0 0 0 0 0)
(1.36238e-12 0 0 0 0 0)
(1.29009e-12 0 6.19242e-34 0 0 3.29656e-55)
(1.22074e-12 0 -9.73254e-31 0 0 8.53237e-49)
(1.15506e-12 0 0 0 0 0)
(1.0937e-12 0 -2.74319e-30 0 0 7.60001e-48)
(1.03719e-12 0 1.77315e-30 0 0 3.35638e-48)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
