cases/transport/0/subsurface/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "300/subsurface";
    object      pMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
7200
(
6.48048e-05
6.60492e-05
6.74839e-05
6.90933e-05
7.08599e-05
7.27641e-05
7.4785e-05
7.69003e-05
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-0.000526984
-0.000548797
-0.00054682
-0.000525635
-0.000479681
-0.000412671
-0.000327063
-0.000225702
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
6.48048e-05
6.60492e-05
6.74839e-05
6.90933e-05
7.08599e-05
7.27641e-05
7.4785e-05
7.69003e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
