cases/transport/0/subsurface/phiSub
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "300/subsurface";
    object      phiSubMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14220
(
1.61482e-10
1.57113e-11
1.46741e-10
1.47405e-11
1.33155e-10
1.35864e-11
1.20896e-10
1.22583e-11
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
        value           nonuniform List<scalar> 
60
(
-1.77193e-10
-1.6811e-10
-1.57463e-10
-1.45592e-10
-1.32766e-10
-1.19203e-10
-1.0508e-10
-9.05516e-11
...
)
;
    }
    right
    {
        type            cyclic;
        value           nonuniform List<scalar> 
60
(
1.77193e-10
1.6811e-10
1.57463e-10
1.45592e-10
1.32766e-10
1.19203e-10
1.0508e-10
9.05516e-11
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
4.20748e-09
4.71592e-09
4.91866e-09
5.12845e-09
4.85987e-09
4.39062e-09
3.73739e-09
2.91065e-09
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
