cases/transport/0/surface/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/surface";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            chesurfaceBottom;
        YiFromSub       uniform 0;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            slip;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
  
}


// ************************************************************************* //
