cases/transport/0/surface/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "300/surface";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7200
(
(9.82376e-06 9.46584e-06 -3.43118e-25)
(-2.78135e-05 4.43508e-06 2.03473e-19)
(-4.09717e-05 6.50782e-06 -7.2418e-22)
(-4.55314e-05 7.03018e-06 -1.12953e-19)
(-8.88719e-05 4.93321e-06 -1.30239e-22)
(-8.90436e-05 2.44617e-06 -6.68322e-20)
(-0.000102268 -7.94331e-07 -4.71969e-20)
(-9.80737e-05 -3.31398e-06 -4.22997e-23)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.139041 -1.52236e-15 -3.96396e-21)
(0.139006 3.04394e-15 -4.87891e-21)
(0.138967 -3.04309e-15 3.10645e-26)
(0.138925 0 6.96056e-21)
(0.138881 0 8.21726e-21)
(0.138834 3.04017e-15 5.10796e-25)
(0.138786 -3.03911e-15 -2.03752e-24)
(0.138736 0 -1.24806e-25)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-1.79812e-06 1.31208e-05 0)
(-2.01541e-06 1.47064e-05 0)
(-2.10206e-06 1.53386e-05 3.9088e-24)
(-2.19171e-06 1.59929e-05 -4.07552e-24)
(-2.07693e-06 1.51553e-05 0)
(-1.87639e-06 1.3692e-05 0)
(-1.59722e-06 1.16549e-05 0)
(-1.2439e-06 9.07673e-06 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
