cases/transport/0/surface/UPrime2Mean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "300/surface";
    object      UPrime2Mean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
7200
(
(2.04063e-09 3.29878e-10 3.56304e-27 5.4702e-10 9.38633e-28 1.49436e-44)
(6.28226e-09 9.85136e-10 1.86135e-27 4.65142e-10 1.3101e-27 1.65146e-44)
(8.33884e-08 7.64098e-09 -1.5376e-26 1.00496e-09 -1.96908e-28 1.27038e-44)
(1.09951e-07 8.41822e-09 8.17954e-30 1.61303e-09 -7.88697e-32 3.66442e-51)
(1.8961e-06 1.18434e-07 3.88717e-26 8.06444e-09 2.9223e-27 1.68941e-45)
(1.67353e-06 1.58655e-07 9.76712e-26 1.59537e-08 9.72937e-27 6.91724e-45)
(2.48557e-06 2.52808e-07 -2.40306e-25 2.7066e-08 -2.519e-26 2.91261e-44)
(2.64226e-06 2.47137e-07 0 2.47117e-08 0 0)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
120
(
(2.45417e-06 0 -2.54476e-27 0 0 2.94995e-46)
(2.46631e-06 0 -3.7915e-27 0 0 6.65216e-46)
(2.48239e-06 0 1.31223e-27 0 0 7.50981e-47)
(2.49955e-06 0 -2.66164e-27 0 0 2.98909e-46)
(2.51681e-06 0 -5.45643e-27 0 0 1.21246e-45)
(2.5342e-06 0 -2.78947e-27 0 0 3.06664e-46)
(2.55164e-06 0 2.8698e-27 0 0 3.1434e-46)
(2.56897e-06 0 -5.80194e-27 0 0 1.25628e-45)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
120
(
(2.7992e-11 -2.04257e-10 0 1.49046e-09 0 0)
(1.21964e-11 -8.89966e-11 -2.26793e-29 6.49405e-10 1.6549e-28 4.21725e-47)
(3.92443e-12 -2.86364e-11 0 2.08959e-10 0 0)
(5.26383e-13 -3.841e-12 0 2.80277e-11 0 0)
(9.64122e-14 -7.03517e-13 0 5.13354e-12 0 0)
(1.37783e-13 -1.0054e-12 0 7.33638e-12 0 0)
(1.95638e-13 -1.42756e-12 3.63791e-31 1.04169e-11 -2.65457e-30 6.76474e-49)
(1.33983e-13 -9.77667e-13 0 7.134e-12 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
