cases/transport/0/surface/advectiveCFluxSurf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "300/surface";
    object      advectiveCFluxSurf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14220
(
1.98447e-06
-1.64424e-06
1.97748e-06
-1.64424e-06
1.97049e-06
-1.64424e-06
1.9635e-06
-1.64424e-06
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
        value           nonuniform List<scalar> 
60
(
-1.99147e-06
-2.07072e-06
-2.15313e-06
-2.23883e-06
-2.32793e-06
-2.42058e-06
-2.51691e-06
-2.61708e-06
...
)
;
    }
    right
    {
        type            cyclic;
        value           nonuniform List<scalar> 
60
(
1.99147e-06
2.07072e-06
2.15313e-06
2.23883e-06
2.32793e-06
2.42058e-06
2.51691e-06
2.61708e-06
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
