cases/transport/0/surface/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "300/surface";
    object      kMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
7200
(
3.12071e-08
4.5438e-08
7.66598e-08
1.10296e-07
1.54801e-07
1.9966e-07
2.45527e-07
2.91747e-07
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.000178658
0.000178653
0.00017865
0.000178646
0.000178644
0.000178641
0.000178639
0.000178637
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
3.12071e-08
4.5438e-08
7.66598e-08
1.10296e-07
1.54801e-07
1.9966e-07
2.45527e-07
2.91747e-07
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
