cases/transport/0/surface/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "300/surface";
    object      nutMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
7200
(
1.75723e-11
2.54101e-11
4.25753e-11
6.08335e-11
8.47882e-11
1.08598e-10
1.32615e-10
1.56477e-10
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.00047464
0.000474403
0.000474001
0.000473546
0.000473048
0.000472514
0.000471947
0.000471342
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
3.95587e-05
6.98253e-05
0.000108486
0.000138171
0.000168596
0.000194342
0.000217295
0.000237986
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
