cases/transport/0/surface/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "300/surface";
    object      omegaMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
7200
(
1775.93
1788.18
1800.57
1813.09
1825.73
1838.51
1851.43
1864.48
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.374386
0.374533
0.37481
0.375133
0.375494
0.375889
0.376316
0.376771
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1775.93
1788.18
1800.57
1813.09
1825.73
1838.51
1851.43
1864.48
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
