cases/transport/0/surface/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "300/surface";
    object      pMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
7200
(
-0.000526984
-0.000548797
-0.00054682
-0.000525635
-0.000479681
-0.000412671
-0.000327063
-0.000225702
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
3.52017e-05
3.98301e-05
4.49701e-05
5.05741e-05
5.65799e-05
6.2921e-05
6.95295e-05
7.63356e-05
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-0.000526984
-0.000548797
-0.00054682
-0.000525635
-0.000479681
-0.000412671
-0.000327063
-0.000225702
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
