cases/transport/0/surface/pPrime2Mean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "300/surface";
    object      pPrime2Mean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 4 -4 0 0 0 0];

internalField   nonuniform List<scalar> 
7200
(
1.17429e-06
1.32152e-06
7.33222e-07
2.18117e-07
2.9048e-08
4.64304e-09
2.42384e-08
7.90649e-08
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1.08295e-06
1.07716e-06
1.07868e-06
1.08206e-06
1.0868e-06
1.0931e-06
1.10086e-06
1.10995e-06
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1.17429e-06
1.32152e-06
7.33222e-07
2.18117e-07
2.9048e-08
4.64304e-09
2.42384e-08
7.90649e-08
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
