cases/transport/0/surface/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "300/surface";
    object      phiMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14220
(
-1.46966e-10
1.46595e-09
-6.00829e-10
1.93203e-09
-7.32159e-10
1.7074e-09
-1.14661e-09
2.07629e-09
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
        value           nonuniform List<scalar> 
60
(
-5.00976e-11
2.96932e-08
8.42163e-08
1.53527e-07
2.20038e-07
2.71301e-07
3.05399e-07
3.24594e-07
...
)
;
    }
    right
    {
        type            cyclic;
        value           nonuniform List<scalar> 
60
(
5.00976e-11
-2.96932e-08
-8.42163e-08
-1.53527e-07
-2.20038e-07
-2.71301e-07
-3.05399e-07
-3.24594e-07
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-4.75211e-26
-8.4025e-27
4.27056e-26
0
0
-1.29662e-25
1.83235e-26
0
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-1.26888e-09
-1.47816e-09
-1.57607e-09
-1.66183e-09
-1.58371e-09
-1.43577e-09
-1.22512e-09
-9.5569e-10
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
