cases/transport/constant/surface/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;

//whether to solve scalar transport in surface domain
CSurfSwitch on;

//whether to solve chemical reactive transport in surface domain
CheSurfSwitch on;

//Laminar Prandtl number for scalar
Pr              Pr [ 0 0 0 0 0 0 0 ] 1.0;
//Turbulent Prandtl number for scalar
Prt              Prt [ 0 0 0 0 0 0 0 ] 1.0;

// ************************************************************************* //
