cases/transport/system/integrateDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

//example: execFlowFunctionObjects -region subsurface -dict system/integrateDict -noFlow

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
functions
{
    totalCO2FluxSurf
    {
        type            surfaceFieldValue;
        libs 			("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;
        surfaceFormat   off;

        // Output to log&file (true) or to file only
        log             true;
        // Output field values as well
        valueOutput     true;
        // Type of source: patch/faceZone/sampledSurface
        region			surface;
		regionType		patch;
		name			bottom;	
		//// if sampledSurface: dictionary with a sampledSurface
        //// Note: will not sample surface fields.
        
		operation       areaNormalIntegrate;
        fields
        (
            U*CO2
        );
    }
}
