cases/transport/system/probes1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields ( C );
probeLocations
(   
    
    (0.0954 0.20 0 )
    (0.0954 0.19 0 )
    (0.0954 0.18 0 )
    (0.0954 0.17 0 )
    (0.0954 0.16 0 )
    (0.0954 0.15 0 )
    (0.0954 0.14 0 )    
    (0.0954 0.13 0 )
    (0.0954 0.12 0 )
    (0.0954 0.11 0 )
    (0.0954 0.10 0 )
    (0.0954 0.098 0 )
    (0.0954 0.096 0 )
    (0.0954 0.094 0 )
    (0.0954 0.092 0 )
    (0.0954 0.09 0 )
    (0.0954 0.088 0 ) 
    (0.0954 0.086 0 ) 
    (0.0954 0.084 0 ) 
    (0.0954 0.082 0 )
    (0.0954 0.08 0 )
    (0.0954 0.078 0 ) 
    (0.0954 0.076 0 ) 
    (0.0954 0.074 0 ) 
    (0.0954 0.072 0 )
    (0.0954 0.07 0 )
    (0.0954 0.068 0 ) 
    (0.0954 0.066 0 ) 
    (0.0954 0.064 0 )
    (0.0954 0.062 0 )
    (0.0954 0.06 0 )
    (0.0954 0.05 0 )
    (0.0954 0.04 0 )
    (0.0954 0.03 0 )
    (0.0954 0.02 0 )
    (0.0954 0.01 0 )
);


);

// ************************************************************************* //
