cases/transport/system/probes2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (C);
probeLocations
(     
    (0.14 0.20 0 )
    (0.14 0.19 0 )
    (0.14 0.18 0 )
    (0.14 0.17 0 )
    (0.14 0.16 0 )
    (0.14 0.15 0 )
    (0.14 0.14 0 )
    (0.14 0.13 0 )
    (0.14 0.12 0 )
    (0.14 0.11 0 )
    (0.14 0.10 0 )
    (0.14 0.09 0 )
    (0.14 0.08 0 )
    (0.14 0.07 0 )
    (0.14 0.06 0 )
    (0.14 0.05 0 )
    (0.14 0.04 0 )
    (0.14 0.03 0 )
    (0.14 0.02 0 )
    (0.14 0.01 0 )
);

// ************************************************************************* //
