cases/transport/system/subsurface/probes1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U CO2 O2);
probeLocations
(   
    (2.55 0.06 0 )
    (2.55 0.05 0 )
    (2.55 0.04 0 )
    (2.55 0.03 0 )
    (2.55 0.02 0 )
    (2.55 0.01 0 )
    (2.55 0.00 0 )
    (2.55 -0.01 0 )
    (2.55 -0.02 0 )
    (2.55 -0.03 0 )
    (2.55 -0.04 0 )
    (2.55 -0.05 0 )
    (2.55 -0.06 0 )
    (2.55 -0.07 0 )
    (2.55 -0.08 0 )
    (2.55 -0.09 0 )
    (2.55 -0.1 0 )
    
    (2.65 0.06 0 )
    (2.65 0.05 0 )
    (2.65 0.04 0 ) 
    (2.65 0.03 0 )
    (2.65 0.02 0 )
    (2.65 0.01 0 )
    (2.65 0.00 0 )
    (2.65 -0.01 0 )
    (2.65 -0.02 0 )
    (2.65 -0.03 0 )
    (2.65 -0.04 0 )
    (2.65 -0.05 0 )
    (2.65 -0.06 0 )
    (2.65 -0.07 0 )
    (2.65 -0.08 0 )
    (2.65 -0.09 0 )
    (2.65 -0.1 0 )

    (2.75 0.06 0 )
    (2.75 0.05 0 )
    (2.75 0.04 0 )
    (2.75 0.04 0 )
    (2.75 0.03 0 )
    (2.75 0.02 0 )
    (2.75 0.01 0 )
    (2.75 0.00 0 )
    (2.75 -0.01 0 )
    (2.75 -0.02 0 )
    (2.75 -0.03 0 )
    (2.75 -0.04 0 )
    (2.75 -0.05 0 )
    (2.75 -0.06 0 )
    (2.75 -0.07 0 )
    (2.75 -0.08 0 )
    (2.75 -0.09 0 )
    (2.75 -0.1 0 )

    (2.85 0.06 0 )
    (2.85 0.05 0 )
    (2.85 0.04 0 )
    (2.85 0.03 0 )
    (2.85 0.02 0 )
    (2.85 0.01 0 )
    (2.85 0.00 0 )
    (2.85 -0.01 0 )
    (2.85 -0.02 0 )
    (2.85 -0.03 0 )
    (2.85 -0.04 0 )
    (2.85 -0.05 0 )
    (2.85 -0.06 0 )
    (2.85 -0.07 0 )
    (2.85 -0.08 0 )
    (2.85 -0.09 0 )
    (2.85 -0.1 0 )


);

// ************************************************************************* //
