cases/transport/system/surface/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (C);
probeLocations
(    
     
    (0.0954 0.13 0 )
    (0.0954 0.12 0 )
    (0.0954 0.11 0 )
    (0.0954 0.10 0 )
    (0.0954 0.09 0 )
    (0.0954 0.08 0 )
    (0.0954 0.07 0 )
    (0.0954 0.06 0 )
    (0.0954 0.05 0 )
    (0.0954 0.04 0 )
    (0.0954 0.03 0 )
    (0.0954 0.02 0 )
    (0.0954 0.01 0 )
);

// ************************************************************************* //
